<template>
<div class="page-full component-set fx-column"> 
    <app-header :title="appHeader.title"></app-header>
    <div class="page-content fx-1">
        <div class="app-content">
            <h1 class="userxy-title">瑞康医生用户协议</h1>
            <p class="userxy-tip">本协议是您与瑞康医生客户端（简称“本客户端”）所有者深圳市恒瑞康信息技术有限
        公司（以下简称为“瑞康医生”）之间就瑞康医生客户端服务等相关事宜所订立的契约，请您仔细阅读本注册协议，您点击“注册”按钮后，本协议即构成对双方有约束力的法律文件。</p>
            <ul class="userxy-content">
                <li>
                    <h2>1.  客户端服务条款的确认和接纳</h2>
                    <ul>
                        <li>1.1  本客户端的各项电子服务的所有权和运作权归瑞康医生所有。用户同意所有注册协议条款并完成注册程序，才能成为本客户端的正式用户。用户确认：本协议条款是处理双方权利义务的契约，始终有效，法律另有强制性规定或双方另有特别约定的，依其规定。</li>
                        <li>1.2  用户点击同意本协议的，即视为用户确认自己具有享受本客户端服务、下单购买等相应的权利能力和行为能力，能够独立承担法律责任。</li>
                        <li class="strong">1.3  如果您在18周岁以下，您只能在父母或监护人的监护参与下才能使用本客户端。</li>
                        <li>1.4   瑞康医生保留在中华人民共和国大陆地区法施行之法律允许的范围内独自决定拒绝服务、封停或禁用用户账户、清除或编辑内容的权利。</li>
                    </ul>
                </li>
                <li>
                    <h2>2.  客户端服务</h2>
                    <ul>
                        <li>2.1  瑞康医生通过互联网依法为用户提供互联网信息等服务，用户在完全同意本协议及本客户端规定的情况下，方有权使用本客户端的相关服务。</li>
                        <li>2.2  用户必须自行准备如下设备和承担如下开支：
                            <ul>
                                <li>（1）上网设备，包括并不限于电脑或者其他上网终端、调制解调器及其他必备的上网装置；</li>
                                <li>（2）上网开支，包括并不限于网络接入费、上网设备租用费、手机流量费等。</li>
                            </ul>
                        </li>
                    </ul>    
                </li>
                <li>
                    <h2>3.  用户信息</h2>
                    <ul>
                        <li>3.1 用户应自行诚信向本客户端提供注册资料，用户保证其提供的注册资料真实、准确、完整、合法有效，用户注册资料如有变动的，应及时更新其注册资料。如果用户提供的注册资料不合法、不真实、不准确、不详尽的，用户需承担因此引起的相应责任及后果，并且瑞康医生保留终止用户使用瑞康医生各项服务的权利。</li>
                        <li class="strong">3.2 用户在本客户端享受相关服务时，涉及用户真实姓名/名称、通信地址、联系电话、电子邮箱等隐私信息的，本站将予以严格保密，除非得到用户的授权或法律另有规定，本站不会向外界披露用户隐私信息。</li>
                        <li>3.3 用户注册成功后，将产生用户名和密码等账户信息，您可以根据本客户端规定改变您的密码。用户应谨慎合理的保存、使用其用户名和密码，并独自就该帐户下的所有活动负责。用户若发现任何非法使用用户账号或存在安全漏洞的情况，请立即通知本客户端并向公安机关报案。</li>
                        <li>3.4 瑞康医生拥有通过邮件、短信电话等形式，向在本客户端注册的用户发送服务提示信息、促销活动等告知信息的权利。</li>
                        <li>3.5 用户不得将在本客户端注册获得的账户借给他人使用，否则用户应承担由此产生的全部责任，并与实际使用人承担连带责任。</li>
                        <li>3.6 在司法机关要求协助的情况下，瑞康医生有权进入用户的注册账户，协助进行证据保全等。</li>
                    </ul>    
                </li>
                <li>
                    <h2>4.  本协议依据国家相关法律法规规章制定，用户应同意严格遵守以下义务：</h2>
                    <ul>
                        <li>（1）不得传输或发表：煽动抗拒、破坏宪法和法律、行政法规实施的言论，煽动颠覆国家政权，推翻社会主义制度的言论，煽动分裂国家、破坏国家统一的的言论，煽动民族仇恨、民族歧视、破坏民族团结的言论；</li>
                        <li>（2）从中国大陆向境外传输资料信息时必须符合中国有关法规；</li>
                        <li>（3）不得利用本客户端从事洗钱、窃取商业秘密、窃取个人信息等违法犯罪活动；</li>
                        <li>（4）不得干扰本客户端的正常运转，不得侵入本客户端及国家计算机信息系统；</li>
                        <li>（5）不得传输或发表任何违法犯罪的、骚扰性的、中伤他人的、辱骂性的、恐吓性的、伤害性的、庸俗的、淫秽的、不文明的等信息资料；</li>
                        <li>（6）不得传输或发表损害国家社会公共利益和涉及国家安全的信息资料或言论；</li>
                        <li>（7）不得教唆他人从事本条所禁止的行为；</li>
                        <li>（8）不得利用在本客户端注册的账户进行牟利性经营活动；</li>
                        <li>（9）不得发布任何侵犯他人著作权、商标权等知识产权或合法权利的内容；用户应关注并遵守本客户端不时公布或修改的各类合法规则规定。本客户端保有删除各类不符合法律政策或不真实的信息内容而无须通知用户的权利。若用户未遵守以上规定的，本客户端有权作出独立判断并采取暂停或关闭用户帐号等措施。用户须对自己在网上的言论和行为承担法律责任。</li>
                        <li>用户承诺若违反本条款项下的义务并因违反义务而造成的任何后果（包括瑞康医生网站遭受的任何损失或损害），由该用户自行独立承担责任（瑞康医生客户端不对用户或任何第三方承担责任）。</li>
                    </ul>    
                </li>
                <li>
                    <h2>5.  所有权及知识产权条款</h2>
                    <ul>
                        <li class="strong">5.1 <span class="strong-u">用户一旦接受本协议，即表明该用户主动将其在任何时间段在本客户端发表的任何形式的信息内容（包括但不限于客户评价、客户咨询、各类话题文章等信息内容）的财产性权利等任何可转让的权利，如著作权财产权（包括并不限于：复制权、发行权、出租权、展览权、表演权、放映权、广播权、信息网络传播权、摄制权、改编权、翻译权、汇编权以及应当由著作权人享有的其他可转让权利），全部授权给瑞康医生使用，并不可撤销，用户同意瑞康医生有权就任何主体侵权而单独提起诉讼。</span></li>
                        <li>5.2 本协议已经构成《中华人民共和国著作权法》第二十五条（条文序号依照2011年版著作权法确定）及相关法律规定的著作财产权等权利转让书面协议，其效力及于用户在瑞康医生客户端上发布的任何受著作权法保护的作品内容，无论该等内容形成于本协议订立前还是本协议订立后。</li>
                        <li class="strong">5.3 <span class="strong-u">用户同意并已充分了解本协议的条款，承诺不将已发表于本客户端的信息，以任何形式发布或授权其它主体以任何方式使用（包括但不限于在各类网站、媒体上使用）。</span></li>
                        <li>5.4 瑞康医生是本客户端的制作者，拥有此客户端内容及资源的著作权等合法权利，受国家法律保护，有权在必要时对本协议及本客户端的内容进行修改，并在本客户端张贴，无须另行通知用户。在法律允许的最大限度范围内，瑞康医生对本协议及本客户端内容拥有解释权。</li>
                        <li class="strong">5.5 除法律另有强制性规定外，未经瑞康医生明确的特别书面许可，任何单位或个人不得以任何方式非法地全部或部分复制、转载、引用、链接、抓取或以其他方式使用本客户端的信息内容，否则，瑞康医生有权追究其法律责任。</li>
                        <li>5.6 本客户端所刊登的资料信息（诸如文字、图表、标识、按钮图标、图像、声音文件片段、数字下载、数据编辑和软件），均是瑞康医生或其内容提供者的财产，受中国和国际版权法的保护。本客户端上所有内容的汇编是瑞康医生的排他财产，受中国和国际版权法的保护。本客户端上所有软件都是瑞康医生或其关联公司或其软件供应商的财产，受中国和国际版权法的保护。</li>
                    </ul>    
                </li>
                <li>
                    <h2>6.  客户端责任限制及不承诺担保</h2>
                    <ul>
                        <li>6.1 除非另有明确的书面说明，本客户端及其所包含的或以其它方式通过本客户端提供给您的全部信息、内容、材料、产品（包括软件）和服务，均是在“按现状”和“按现有”的基础上提供的。除非另有明确的书面说明，作为服务的一部分或通过您使用服务得到的所有信息（如数据文件、书面文本、电脑软件、音乐、音像文件或其他声音、图片、录像或其他图像），完全由发布该内容的人员负责，瑞康医生不对本客户端的运营及其包含在本客户端上的信息或服务作任何形式的、明示或默示的声明或担保（根据中华人民共和国法律另有规定的以外）。</li>
                        <li>6.2 瑞康医生不担保本客户端所包含的或以其它方式通过本客户端提供给您的全部信息、内容、材料、产品（包括软件）和服务、其服务器或从本客户端发出的电子信件、信息没有病毒或其他有害成分。如因不可抗力或其它本站无法控制的原因使本客户端销售系统崩溃或无法正常使用导致网上交易无法完成或丢失有关的信息、记录等，瑞康医生会合理地尽力协助处理善后事宜。</li>
                        <li>6.3 瑞康医生所承载的内容（文、图、视频、音频）均为传播有益健康资讯目的，不对其真实性、科学性、严肃性做任何形式保证。</li>
                        <li>6.4 瑞康医生所有信息仅供参考，不做个别诊断、用药和使用的根据。</li>
                        <li class="strong">6.5 瑞康医生致力于提供正确、完整的健康资讯及药品信息，但不保证信息的正确性和完整性，且不对因信息的不正确或遗漏导致的任何损失或损害承担责任。</li>
                        <li>6.6 瑞康医生所提供的任何健康资讯及药品信息，仅供参考，不能替代医生和其他医务人员的建议，建议您谨遵医嘱，如自行使用瑞康医生中资料导致身体不适或其他异常状况，深圳市恒瑞康信息技术有限公司概不负责，亦不负任何法律责任。</li>
                        <li>6.7 《症状自诊》模块中的服务数据来自专业临床数据收集整理。自诊结果仅为依据用户输入的性别，年龄，部位，症状等信息作出的参考性建议，不能作为诊断及医疗的依据，建议您根据需要及时去医院进一步诊断治疗。</li>
                        <li>6.8 《急救常识》模块中是否采用瑞康医生的应急预护理措施为用户个人行为，深圳市恒瑞康信息技术有限公司不承担任何可能产生的责任。</li>
                        <li>6.9 深圳市恒瑞康信息技术有限公司保留对本协议作出不定时修改的权利。</li>
                    </ul>    
                </li>
                <li>
                    <h2>7.  信息服务内容</h2>
                    <ul>
                        <li>7.1 瑞康医生有权随时作出删除相关信息、终止服务提供等处理，而无须征得用户的同意。</li>
                        <li>7.2 如存在下列情况，瑞康医生有义务对相关数据、所有的用户行为以及与自诊有关的其它事项进行审查：
                            <ul>
                                <li>（1）用户或其它第三方通知瑞康医生，认为某个具体模块或页面功能可能存在重大问题；</li>
                                <li>（2）用户或其它第三方向瑞康医生告知资料内容有违法或不当行为的，瑞康医生以普通非专业的知识水平标准对相关内容进行判别，可以明显认为这些内容或行为具有违法或不当性质的。</li>
                            </ul>
                        </li>
                        <li>7.3 瑞康医生有权根据不同情况选择保留或删除相关信息或继续、停止对该用户提供服务，并决定是否追究相关法律责任。</li>
                        <li>7.4 因在瑞康医生上发生服务纠纷，引起诉讼的，用户通过司法部门或行政部门依照法定程序要求瑞康医生提供相关数据，瑞康医生应积极配合并提供有关资料。</li>
                        <li>7.5  瑞康医生有权对用户的注册数据及使用行为进行查阅，发现注册数据或使用行为中存在任何问题或怀疑，均有权向用户发出询问及要求改正的通知或者直接作出账号封停或禁用等处理。</li>
                        <li>7.6 用户对客户端提供信息内容不满意，可以向瑞康医生提出投诉，瑞康医生有义务依据情况优化或编辑准确信息。</li>
                        <li>7.7 系统因下列状况无法正常运作，使用户无法使用手机或平板设备享受客户端服务时，瑞康医生不承担损害赔偿责任，该状况包括但不限于：
                            <ul>
                                <li>（1）瑞康医生在本网站公告之系统停机维护期间。</li>
                                <li>（2）电信设备出现故障不能进行数据传输的。</li>
                                <li>（3）因台风、地震、海啸、洪水、停电、战争、恐怖袭击等不可抗力之因素，造成系统障碍不能执行业务的。</li>
                                <li>（4）由于黑客攻击、电信部门技术调整或故障、医院接口方面的问题等原因而造成的服务中断或者延迟。</li>
                            </ul>
                        </li>
                    </ul>    
                </li>
                <li>
                    <h2>8.  协议更新及用户关注义务</h2>
                    <ul>
                        <li>根据国家法律法规变化及网络运营需要，瑞康医生有权对本协议条款不定期地进行修改，修改后的协议一旦被张贴在本客户端上即生效，并代替原来的协议。用户可随时登陆查阅最新协议；用户有义务关注并阅读最新版的协议及客户端公告。如用户不同意更新后的协议，可以且应立即停止接受瑞康医生客户端依据本协议提供的服务；如用户继续使用本客户端提供的服务，即视为同意更新后的协议。瑞康医生建议您在使用本客户端之前阅读本协议及本客户端的公告。如果本协议中任何一条被视为废止、无效或因任何理由不可执行，该条应视为可分的且并不影响任何其余条款的有效性和可执行性。</li>
                    </ul>    
                </li>
                <li>
                    <h2>9.  法律管辖和适用</h2>
                    <ul>
                        <li>本协议的订立、执行和解释及争议的解决均应适用在中华人民共和国大陆地区适用之有效法律（但不包括其冲突法规则）。如发生本协议与适用之法律相抵触时，则这些条款将完全按法律规定重新解释，而其它有效条款继续有效。如缔约方就本协议内容或其执行发生任何争议，双方应尽力友好协商解决；协商不成时，任何一方均可向本公司所在地法院提起诉讼。</li>
                    </ul>    
                </li>
                <li>
                    <h2>10. 其他</h2>
                    <ul>
                        <li>10.1    瑞康医生客户端所有者是指在政府部门依法许可或备案的瑞康医生经营主体。</li>
                        <li>10.2    瑞康医生尊重用户和消费者的合法权利，本协议及本客户端上发布的各类规则、声明等其他内容，均是为了更好的、更加便利的为用户和消费者提供服务。本客户端欢迎用户和社会各界提出意见和建议，瑞康医生将虚心接受并适时修改本协议及本客户端的各类规则。</li>
                        <li>10.3    本协议内容中以黑体、加粗、下划线、斜体等方式显著标识的条款，请用户重点阅读。</li>
                        <li>10.4    当您注册瑞康医生时，即视为完全<span class="strong">接受《瑞康医生用户协议》</span>，在点击之前请您再次确认已知悉并完全理解本协议的全部内容。</li>
                    </ul>    
                </li>
            </ul>
            <p class="userxy-bottom">深圳市恒瑞康信息技术有限公司<br>2016 年 1 月</p>
        </div>
    </div>
</div>
</template>

<script>
import { mapGetters, mapActions } from 'vuex'
import appHeader from '../../components/app-header.vue'

export default {
    components: { appHeader },
    data (){
        return {
            appHeader: {
                title: '用户协议'
            },
        }
    },
    computed: {
    },
    methods: {
    },
    created () {
    }
}
</script>

<style lang="less" scoped>
@import "../../assets/css/common.less";

.page-content{
    background-color: #fff; 
}
.userxy-title{
    margin-top: 0.56rem;
    margin-bottom: 0.3rem;
    text-align: center;
    font-size: 0.28rem;
    color: #212020;
}
.userxy-title, .userxy-tip, .userxy-bottom, .userxy-content, .symptom-top, .symptom-item-header{
    padding: 0 0.15rem;
}
.userxy-tip,.userxy-content{
    font-size: 0.2rem;
    color: #4f4f4f;
    line-height: 1.5;
}
.strong{
    font-weight: bold;
}
.userxy-tip{
    text-indent: 2em;
}
.userxy-bottom{
    padding-top: 0.74rem;
    padding-bottom: 0.74rem;
    text-align: right;
    font-size: 0.24rem;
    line-height: 1.25;
    color: #000;
}
.userxy-content{ 
    & > li > ul{
        margin-left: 1em;
        & > li{
            text-indent: 2em;
            & > ul{
                margin-left: 2em;
                & > li{
                    text-indent: 0;
                }
            }
        }
    }
    & h2{
        margin: 0.24rem 0 0.04rem 0;
        font-size: 0.22rem;
        color: #212020;
        font-weight: bold;
    }
}
.strong-u{
    text-decoration: underline;
}
</style>
